  # 未使用
STOP_WORDS = [
    "看到",
    "起来",
    "上来",
]

# ===================================================
# ==================== 全局白名单 ====================
# ===================================================
TOTAL_WHITE = ["嫌疑人"]
LOOKAHEAD_WHITE = [
    ["刷单", "陌生", "诈骗"],
]

# lookahead
LOOKAHEAD = [
    ["下载软件", "身份证|护照|实名", "元|奖励|红包|佣金|礼金|块钱"],
    # ["贷款", "身份证|护照|实名", "奖励|红包|佣金|礼金|块钱"],
]


# ===================================================
# ==================== 全局黑名单 ====================
# ===================================================
RE = [
    "re=快递.{0,50}?(不小心|工作人员|大意|运输过程|路上|尾|单号),{0,20}?(丢|遗)",
    "re=快递.*?(礼|赠品).*?(免费)",
    "re=是.{0,12}?(服).*?邀请.{0,6}?(网红|商家|达人|博主|主播).*?(点赞|关注)",
    "re=给.{0,12}?(网红|商家|达人|博主|主播).{0,4}?(点赞|关注).*?(单|兼职|元|不等|佣金|用金)",
    "re=是.{0,12}?(局|中心|科|队|部|办公室).*?重要.{0,6}?(事情|文件|档案|调查|案件|案情|刑侦|名下)",
    "re=是.{0,12}?(局|中心|科|队|部|办公室).*?名下.*?发.*?(短信|广告|骚扰|政府)", #新加
   

    "re=是.{0,12}?(教育|中心|客服|学堂|网课|网校|机构|平台|学网).*?(缴纳|学费|办理).*?(退费|退款)", #教育退费
    # 存疑
    "re=是.{0,12}?(局|中心|科|队|部|办公室|客服).*?(骚扰|诈骗).*?(承诺书|停机)",
    "re=贷款.*?国家.{2,10}?政策",
    "re=国家.{2,10}?政策.*?贷款",
]

BLACK_1 = ["京东金条", "金条账户", "京东白条","京东金融", "re=(淘宝|京东|拼多多|快手|美团)商家联盟", "re=(淘宝|京东)商.{0,6}?(中心|部|工作人员)",
           "八八会员业务", "网红点赞", "商城财务中心", "外盘期货"] + RE  # "现金红包",#新加京东金融


# ===================================================
# ================= 类别黑名单 （3词）=================
# ===================================================

BLACK_3 = {
    # A+B+C :black最高等级
    "冒充公检法_high": {"A": ["公安局", "户政科", "社保局", "管理局", "刑侦支队", "互联网举报中心", "药监局", "反欺诈中心", "拘留审查部", "110报案中心", "稽查科", "侦查队", "网信办", "监督局", "通信局", "税务稽查", "反电信", "疾控","互联网信息办公室"],
              "B": ["身份证", "协商文件", "护照", "大量发送", "举报", "协调"],
              "C": ["来一趟", "异常使用", "违规使用", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "批评政府", "通知"]},

    "冒充机关单位购物_high": {"A": ["疾控", "消防", "中队", "部队", "公安", "武警"],
                 "B": ["猪肉", "猪热", "五花肉", "后腿肉", "药物"],
                 "C": ["现金", "结算"]},

    "冒充机关退费_high": {
        "A": ["医保中心"],
        "B": ["灵活就业", "邻国就业"],
        "C": ["费"], },

    "快递退费_high": {"A": ["中通", "快递", "韵达", "天天", "圆通", "快手", "商城"],
             "B": ["弄丢", "遗失", "丢失", "丢了", "运单尾号", "不小心"],
             "C": ["商品价格", "多少钱", "协商", "理赔", "什么产品", "赔款", "退款", "退保", "钱退还", "赔付"]},

    "刷单_high": {"A": ["平台", "推广", "小助手", "客服", "斗因", "抖音", "快手"],  # , "等于克服"
           "B": ["点赞", "关注", "网红", "双击", "兼职"],
           "C": ["一单一", "结算", "押金", "收入", "每单", "不收取", "元", "佣金"]},


    "京东金条_high": {"A": ["京东", "金条", "白条", "淘宝", "快手", "抖音", "88V", "八八会员业务", "蘑菇街", "商城财务中心", "微信商城","百万保障"],#新加百万保障
             "B": ["实名制", "注册", "身份证", "无意中", "不小心", "实习生", "实习员工", "操作失误", "开通", "总结算日", "绑定"],
             "C": ["真心", "征信", "注销", "关闭", "交易记录", "扣费", "取消", "协商", "代理商", "抱歉", "扣款"]
             },

    "平台送礼_high": {"A": ["天猫超市", "美团", "商家联盟", "淘宝", "抖音", "快手"],  # "新相应", "心相印","新乡一"
             "B": ["周年庆", "回馈", "派发", "助力"],
             "C": ["赠送", "免费", "礼品", "送礼"]},
    ####
    "好评返现_low": {"A": ["天猫超市", "美团", "商家联盟", "淘宝", "抖音", "快手"],  # "新相应", "心相印","新乡一"
                 "B": ["好评", "刷单"],
                 "C": ["免费", "礼品", "块钱"]},

    "调研返现_high": {
        "A": ["四S", "车展"],
        "B": ["问卷", "调研"],
        "C": ["现金", "返现"]}
}

# ===================================================
# ================= 类别黑名单 （2词）=================
# ===================================================

BLACK_2 = {
    "冒充公检法re_high": {
        "A": ["re=是.{0,12}?(局|中心|科|队|中心|部|办公室).*?带.{0,4}?身份证*?(来)"],
        "B": ["协商文件", "护照", "大量发送", "举报", "来一趟", "异常使用", "纠纷", "重要", "违规使用", "律师", "起诉", "医保", "官司", "犯法", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "公文", "批评政府", "扣款", "不小心"],
        "num": 3
    },

    "冒充公检法re2_high": {
        "A": ["re=是.{0,12}?(局|中心|科|队|中心|部|办公室).*?(事情|马上|在哪里|情况)*?(来)"],
        "B": ["协商文件", "护照", "大量发送", "举报", "来一趟", "异常使用", "纠纷", "重要", "违规使用", "律师", "起诉", "医保", "官司", "犯法", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "公文", "批评政府", "扣款", "不小心"],
        "num": 3
    },

    "送礼re_low": {
        "A": ["re=(回馈|感恩|免费|赠送|中奖|中将).{0,20}?(用户|客户|贵宾)"],
        "B": ["包邮", "快递", "发货", "送上门", "送过去", "物流"],
        "num": 2
    },

    # A+B>=3:black第二等级
    "冒充公检法AB_middle": {"A": ["公安局", "户政科", "社保局", "管理局", "刑侦支队", "互联网举报中心", "药监局", "反欺诈中心", "拘留审查部", "110报案中心", "稽查科", "侦查队", "网信办", "监督局", "通信局", "税务稽查", "反电信", "疾控"],
                "B": ["身份证", "协商文件", "护照", "大量发送", "举报", "来一趟", "异常使用", "违规使用", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "公文", "批评政府"],
                },

    "问卷返现AB_middle": {"A": ["问卷", "调研"],
               "B": ["现金", "返现", "奖励", "红包"]
               },

    "快递退费AB_middle": {"A": ["re=(中通|韵达|天天|圆通)", "微信小程序财务中心", "快递"],
               "B": ["核实", "电话客服", "弄丢", "遗失", "丢失", "收件人", "运单尾号", "不小心", "商品价格", "多少钱", "协商", "理赔", "什么产品"],
               "num": 4
               },

    "京东金条类金融AB_middle": {"A": ["京东", "金条", "白条", "淘宝", "快手", "抖音", "88VIP", "八八会员业务", "蘑菇街", "商城财务中心", "微信商城"],
                  "B": ["实名制", "注册", "身份证", "无意中", "不小心", "实习生", "实习员工", "操作失误", "开通", "申请", "总结算日", "真心", "征信", "注销", "关闭", "交易记录", "扣费", "取消", "协商", "代理商", "抱歉", "扣款", "泄露"],
                  "num": 4
                  },

    "刷单AB_middle": {"A": ["平台", "推广", "小助手", "客服", "斗因", "抖音", "快手"],  # "等于克服"
             "B": ["点赞", "关注", "网红", "一单一", "结算", "押金", "收入", "每单", "不收取", "佣金"],
             "num": 4
             },

    "博彩AB_middle": {
        "A": ["新葡京", "威尼斯人", "银河", "亚博", "网","金沙"], #新加
        "B": ["博彩", "伯才", "擦皮奥", "六合彩", "押大小", "彩票", "查票", "彩金", "赌博", "赌", "赌场", "赌钱", "赌球", "赌球", "赌马", "娱乐", "赌徒", "博彩公司", "网上赌博", "投注", "庄家", "赌资", "赌石", "赌城", "棋牌", "扑克", "筹码", "龙虎斗", "百家乐", "轮盘", "角子机", "拉斯维加斯", "赌场风云", "赌博片", "博弈论", "赌术", "赌技", "赌博游戏", "亚洲博彩", "澳门博彩","流水","六合彩"],
        "num": 4
    },

    "游戏AB_low": {
        "A": ["账号", "游戏", "手游", "棋牌", "充值", "提现","线上娱乐","新葡京", "威尼斯人", "银河", "亚博","金沙","客服","平台"],#”电子“,”麻将“
        # +["外挂","加速器","破解","辅助","升级","刷钱","刷经验"]+["游戏币","装备","道具","皮肤","背包","英雄","游戏角色"],
        "B": ["回收", "礼包", "新用户", "老玩家", "彩金", "活动", "奖励", "优惠", "福利", "红包", "返利","就送","流水","包赔包退","六合彩"],#"充值就送"  #新加
        "num": 4
    }
}