# 未使用
STOP_WORDS = [
    "看到",
    "起来",
    "上来",
]

# ===================================================
# ==================== 全局白名单 ====================
# ===================================================
TOTAL_WHITE = ["嫌疑人"]
LOOKAHEAD_WHITE = [
    ["刷单", "陌生", "诈骗"],
]

# lookahead
LOOKAHEAD = [
    ["下载软件", "身份证|护照|实名", "元|奖励|红包|佣金|礼金|块钱"],
    ["贷款", "身份证|护照|实名", "元|奖励|红包|佣金|礼金|块钱"],
]


# ===================================================
# ==================== 全局黑名单 ====================
# ===================================================
RE = [
    "re=快递.{0,50}?(不小心|工作人员|大意|运输过程|路上|尾|单号),{0,20}?(丢|遗)",
    "re=快递.*?(礼|赠品).*?(免费)",
    "re=是.{0,12}?(服).*?邀请.{0,6}?(网红|商家|达人|博主|主播).*?(点赞|关注)",
    "re=是.{0,12}?(局|中心|科|队|部|办公室).*?重要.{0,6}?(事情|文件|档案|调查|案件|案情|刑侦|名下)"
    # 存疑
    "re=是.{0,12}?(局|中心|科|队|部|办公室|客服).*?(骚扰|诈骗).*?(承诺书|停机)",
    "re=贷款.*?国家.{2,10}?政策",
    "re=国家.{2,10}?政策.*?贷款",
]

BLACK_1 = ["京东金条", "金条账户", "京东白条", "re=(淘宝|京东|拼多多|快手|美团)商家联盟", "re=(淘宝|京东)商.0,6?(中心|部|工作人员)",
           "八八会员业务", "网红点赞", "商城财务中心", "外盘期货"] + RE  # "现金红包",


# ===================================================
# ================= 类别黑名单 （3词）=================
# ===================================================

BLACK_3 = {
    # A+B+C :black最高等级
    "冒充公检法": {"A": ["公安局", "户政科", "社保局", "管理局", "刑侦支队", "互联网举报中心", "药监局", "反欺诈中心", "拘留审查部", "110报案中心", "稽查科", "侦查队", "网信办", "监督局", "通信局", "税务稽查", "反电信", "疾控"],
              "B": ["身份证", "协商文件", "护照", "大量发送", "举报", "协调"],
              "C": ["来一趟", "异常使用", "违规使用", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "批评政府", "通知"]},

    "冒充机关单位购物": {"A": ["疾控", "消防", "中队", "部队", "公安", "武警"],
                 "B": ["猪肉", "猪热", "五花肉", "后腿肉", "药物"],
                 "C": ["现金", "结算"]},

    "冒充机关退费": {
        "A": ["医保中心"],
        "B": ["灵活就业", "邻国就业"],
        "C": ["费"], },

    "快递退费": {"A": ["中通", "快递", "韵达", "天天", "圆通", "快手", "商城"],
             "B": ["弄丢", "遗失", "丢失", "丢了", "运单尾号", "不小心"],
             "C": ["商品价格", "多少钱", "协商", "理赔", "什么产品", "赔款", "退款", "退保", "钱退还", "赔付"]},

    "刷单": {"A": ["平台", "推广", "小助手", "客服", "斗因", "抖音", "快手"],  # , "等于克服"
           "B": ["点赞", "关注", "网红", "双击", "兼职"],
           "C": ["一单一", "结算", "押金", "收入", "每单", "不收取", "元", "佣金"]},


    "京东金条": {"A": ["京东", "金条", "白条", "淘宝", "快手", "抖音", "88V", "八八会员业务", "蘑菇街", "商城财务中心", "微信商城"],
             "B": ["实名制", "注册", "身份证", "无意中", "不小心", "实习生", "实习员工", "操作失误", "开通", "总结算日", "绑定"],
             "C": ["真心", "征信", "注销", "关闭", "交易记录", "扣费", "取消", "协商", "代理商", "抱歉", "扣款"]
             },

    "平台送礼": {"A": ["天猫超市", "美团", "商家联盟", "淘宝", "抖音", "快手"],  # "新相应", "心相印","新乡一"
             "B": ["周年庆", "回馈", "派发", "助力"],
             "C": ["赠送", "免费", "礼品", "送礼"]},
    ####
    "好评返现_low": {"A": ["天猫超市", "美团", "商家联盟", "淘宝", "抖音", "快手"],  # "新相应", "心相印","新乡一"
                 "B": ["好评", "刷单"],
                 "C": ["免费", "礼品", "块钱"]},

    "调研返现": {
        "A": ["四S", "车展"],
        "B": ["问卷", "调研"],
        "C": ["现金", "返现"]}
}

# ===================================================
# ================= 类别黑名单 （2词）=================
# ===================================================

BLACK_2 = {
    "冒充公检法re": {
        "A": ["re=是.{0,12}?(局|中心|科|队|中心|部|办公室).*?带.{0,4}?身份证*?(来)"],
        "B": ["协商文件", "护照", "大量发送", "举报", "来一趟", "异常使用", "纠纷", "重要", "违规使用", "律师", "起诉", "医保", "官司", "犯法", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "公文", "批评政府", "扣款", "不小心"],
        "num": 3
    },

    "冒充公检法re2": {
        "A": ["re=是.{0,12}?(局|中心|科|队|中心|部|办公室).*?(事情|马上|在哪里|情况)*?(来)"],
        "B": ["协商文件", "护照", "大量发送", "举报", "来一趟", "异常使用", "纠纷", "重要", "违规使用", "律师", "起诉", "医保", "官司", "犯法", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "公文", "批评政府", "扣款", "不小心"],
        "num": 3
    },

    "送礼re_low": {
        "A": ["re=(回馈|感恩|免费|赠送|中奖|中将).{0,20}?(用户|客户|贵宾)"],
        "B": ["包邮", "快递", "发货", "送上门", "送过去", "物流"],
        "num": 2
    },

    # A+B>=3:black第二等级
    "冒充公检法AB": {"A": ["公安局", "户政科", "社保局", "管理局", "刑侦支队", "互联网举报中心", "药监局", "反欺诈中心", "拘留审查部", "110报案中心", "稽查科", "侦查队", "网信办", "监督局", "通信局", "税务稽查", "反电信", "疾控"],
                "B": ["身份证", "协商文件", "护照", "大量发送", "举报", "来一趟", "异常使用", "违规使用", "强制停机", "配合调查", "中奖短信", "核对", "核实", "协查", "公文", "批评政府"],
                },

    "问卷返现AB": {"A": ["问卷", "调研"],
               "B": ["现金", "返现", "奖励", "红包"]
               },

    "快递退费AB": {"A": ["re=(中通|韵达|天天|圆通)", "微信小程序财务中心", "快递"],
               "B": ["核实", "电话客服", "弄丢", "遗失", "丢失", "收件人", "运单尾号", "不小心", "商品价格", "多少钱", "协商", "理赔", "什么产品"],
               "num": 4
               },

    "京东金条类金融AB": {"A": ["京东", "金条", "白条", "淘宝", "快手", "抖音", "88VIP", "八八会员业务", "蘑菇街", "商城财务中心", "微信商城"],
                  "B": ["实名制", "注册", "身份证", "无意中", "不小心", "实习生", "实习员工", "操作失误", "开通", "申请", "总结算日", "真心", "征信", "注销", "关闭", "交易记录", "扣费", "取消", "协商", "代理商", "抱歉", "扣款", "泄露"],
                  "num": 4
                  },

    "刷单AB": {"A": ["平台", "推广", "小助手", "客服", "斗因", "抖音", "快手"],  # "等于克服"
             "B": ["点赞", "关注", "网红", "一单一", "结算", "押金", "收入", "每单", "不收取", "佣金"],
             "num": 4
             },

    "博彩AB": {
        "A": ["新葡京", "威尼斯人", "银河", "亚博", "网"],
        "B": ["博彩", "伯才", "擦皮奥", "六合彩", "押大小", "彩票", "查票", "彩金", "赌博", "赌", "赌场", "赌钱", "赌球", "赌球", "赌马", "威尼斯", "娱乐", "赌徒", "博彩公司", "网上赌博", "投注", "庄家", "赌资", "赌石", "赌城", "棋牌", "扑克", "筹码", "龙虎斗", "百家乐", "轮盘", "角子机", "拉斯维加斯", "赌场风云", "赌博片", "博弈论", "赌术", "赌技", "赌博游戏", "亚洲博彩", "澳门博彩"],
        "num": 4
    },

    "游戏AB_low": {
        "A": ["账号", "游戏", "手游", "棋牌", "充值", "提现"],
        # +["外挂","加速器","破解","辅助","升级","刷钱","刷经验"]+["游戏币","装备","道具","皮肤","背包","英雄","游戏角色"],
        "B": ["回收", "礼包", "新用户", "老玩家", "彩金", "平台", "活动", "奖励", "优惠", "福利", "红包", "返利"],
        "num": 4
    }
}


# ===================================================
# ======================== 备注======================
# ===================================================
# 网贷
# 贷款、信用卡
# 游戏
# 电商好评返现
# 理财（外盘期货）

# 政府单位
government_agency = ["消防", "部队", "公安", "工安", "公案", "法院", "发源", "检察", "局", "管理中心",
                     "档案中心", "出入境", "部门", "国家", "中心", "人社", "民政", "质监", "税务", "工商", "知识产权", "审计"]
government_agency_shop = ["消防", "部队", "武警", "吴京"]

total_white = ["口腔", "车险", "装修", "到店", "新东方", "太平洋",
               "平安保险", "平安车险", "体验课"]  # ,"简历","招聘","实习","底薪"
# total_white = []
total_black = ["刑侦", "刑法", "消防中队", "新相应", "心相印"]
# 恐吓
scare = ["官司", "境外", "调查", "协查", "核查", "刑事", "犯法", "刑法", "征信", "怀疑", "担心", "一场", "异常", "可疑", "人脸", "冻结", "专项行动", "强制", "重要", "危及", "紧急", "危险",
         "安全风险", "安全隐患", "安保", "保密", "处罚", "处分", "催收", "征收", "采集", "取证", "判决", "判刑", "刑期", "判罚", "判决书", "裁决", "裁定",
         "裁判", "审判", "审讯", "审查", "调解", "调查取证", "调查组", "许诺书", "承诺书", "违法", "违规", "违纪", "违法行为", "违纪行为", "违规行为", "违法犯罪", "犯罪嫌疑", "犯罪记录", "取证", "纠纷"]

# 回馈
feedback = ["奖励", "现金", "红包", "佣金", "收入", "赚钱", "送手机", "派发", "礼品",
            "领取", "福利", "礼物", "抽成", "块钱", "百块", "千块", "万块", "分红", "回馈", "好礼"]

# 礼物
gift = ["现金", "红包", "送手机", "礼品", "领取", "福利", "礼物", "免费", "抽成", "好礼"]

# 快递
express = ["快递", "韵达", "顺风", "顺丰", "圆通",
           "中通", "申通", "邮政", "EMS", "百世", "天天", "德邦"]

# 问卷/调研/网络兼职
questionnaire = ["问卷", "调研", "叼烟", "文娟", "问答", "兼职"]

# APP
app = ["京东", "美团", "致富宝", "致富包", "生活号", "平台", "直播",
       "支付宝", "淘宝", "抖音", "天猫", "小红书", "快手", "拼多多", "大众点评"]

# 点赞转发
like = ["点赞", "关注", "收藏", "转发", "分享", "好评", "五星", "评价"]

# 加盟
join = ["入驻", "入住", "加盟", "带货", "带火", "加入", "合作", "销售", "渠道", "合作伙伴", "合作共赢", "成为合作伙伴",
        "加盟合伙人", "经销商加盟", "代理加盟", "合作代理", "战略合作", "合作开发", "加入我们", "共赢合作", "加盟支持", "经销商招募", "品牌加盟"]

# 博彩
gambling = ["博彩", "伯才", "擦皮奥", "六合彩", "彩票", "查票", "彩金", "赌博", "赌", "赌场", "赌钱", "赌球", "赌球", "赌马", "威尼斯", "娱乐", "赌徒", "博彩公司", "网上赌博", "投注",
            "庄家", "赌资", "赌石", "赌城", "棋牌", "扑克", "筹码", "龙虎斗", "百家乐", "轮盘", "角子机", "拉斯维加斯", "赌场风云", "赌博片", "博弈论", "赌术", "赌技", "赌博游戏", "亚洲博彩", "澳门博彩"]

# 医保
health_insurance = ["医保"]

BLACK_NUM = {
    "恐吓": {
        "A": scare+government_agency+["医保"],
        "num": 5
    }

}


if __name__ == '__main__':
    import re
    from rrr_filter_plus import word_list_to_pattern

    word_list = [["下载软件", "身份证|护照", "元"],
                 ["贷款", "无抵押", "政策"]]

    print(word_list_to_pattern(word_list))
