# a_keywords = ("抖音","快手","拼多多","京东","商城","主播","电商达人","网红","电信","天猫","局","部","单位","美团","客服","专柜","足力舰","足力健","社区","淘宝","商家联盟","新相应","心相印","客服","北大方正","致富宝","生活号","招商中心","平台","京东","商场","客服","中心","消防","外盘","期货","平台","医保","网约车","来一份","银行","客户经理","工作人员","公安","社保","出入境管理","反通讯","反电信","快递","韵达","顺风","顺丰","圆通","中通")
# b_keywords = ("直播","推广","快递","入驻","问卷","调研","关注","点赞","网络兼职","押大小","激活","活动","三八妇女节","母亲节","儿童节","建军节","七夕节","教师节","中秋节","国庆节","万圣节","感恩节","春节","过年","周年庆","回馈","赠送","添加","微信","扣扣","女神节","赠送","直播","金条账户","开通","身份证尾号","金条服务","订购","猪热","猪肉","肉","加我","灵活就业","交费","押金","加盟","项目","贷款","注册","存款","手游","游戏","激活","办理","身份证","携带","工号","缴费","额度","资产","抵押","利息","佣金","下载","链接","连接","办公室","单位")
# c_keywords = ("元","现金","红包","收入","赚钱","送手机","派发","礼品","领取","优惠","福利","礼物","免费","抽成","关闭","关了","取消","结算","交易","退费","退款","块钱","百块","千块","万块","利率","中奖","分红","资金","分润","回馈","官司","境外","调查","协查","核查","刑事","犯法","刑法","征信","怀疑","担心","一场","异常","可疑","人脸","送","派送","冻结","国家","专项行动","强制","激活","注册","弄丢","遗失","招募","重要","危及","紧急","危险")
# black_words = ("京东金","彩票","茶票","六合彩","六号彩","中奖","点赞","致富宝生活","致富宝招商","支付宝生活号","支付宝招商")










"""
类目列表
高危
    1. 金融APP类 (京东金融，美团账户异常)
    2. 冒充机关单位恐吓
    3. 冒充机关单位购物
    4. 退费
    5. 免费送礼（快递发货）
    6. 中奖
    7. 问卷返现
    8. 博彩
    9. 网游
    10. 冒充客服
    11. 快递丢失
    12. 刷单

中危
    1. 加盟入驻
    2. 好评返现
    3. 回馈老用户
    4. 医保退费

"""
# 黑词，命中即判定为高危

# 政府单位
government_agency = ["消防","部队","公安","工安","公案","法院","发源","检察","局","管理中心","档案中心","出入境","部门","国家","中心","人社","民政","质监","税务","工商","知识产权","审计"]
government_agency_shop = ["消防","部队","武警","吴京"]

total_white = ["口腔","车险","装修","到店","新东方","太平洋","平安保险","平安车险","体验课"] # ,"简历","招聘","实习","底薪"
# total_white = []
total_black = ["刑侦","刑法","消防中队","新相应","心相印"]
# 恐吓
scare = ["官司","境外","调查","协查","核查","刑事","犯法","刑法","征信","怀疑","担心","一场","异常","可疑","人脸","冻结","专项行动","强制","重要","危及","紧急","危险",
    "安全风险", "安全隐患", "安保", "保密", "处罚", "处分", "催收", "征收", "采集", "取证", "判决", "判刑", "刑期", "判罚", "判决书", "裁决", "裁定", 
    "裁判", "审判", "审讯", "审查", "调解", "调查取证", "调查组", "许诺书","承诺书","违法", "违规", "违纪", "违法行为", "违纪行为", "违规行为", "违法犯罪", "犯罪嫌疑", "犯罪记录","取证","纠纷"]

# 回馈
feedback = ["奖励","现金","红包","佣金","收入","赚钱","送手机","派发","礼品","领取","福利","礼物","抽成","块钱","百块","千块","万块","分红","回馈","好礼"]

# 礼物
gift = ["现金","红包","送手机","礼品","领取","福利","礼物","免费","抽成","好礼"]

# 快递
express = ["快递","韵达","顺风","顺丰","圆通","中通","申通","邮政","EMS","百世","天天","德邦"]

# 问卷/调研/网络兼职
questionnaire = ["问卷","调研","叼烟","文娟","问答","兼职"]

# APP
app = ["京东","美团","致富宝","致富包","生活号","平台","直播","支付宝","淘宝","抖音","天猫","小红书","快手","拼多多","大众点评"]

# 点赞转发
like = ["点赞","关注","收藏","转发","分享","好评","五星","评价"]

# 加盟
join = ["入驻","入住","加盟","带货","带火","加入","合作","销售","渠道","合作伙伴", "合作共赢","成为合作伙伴","加盟合伙人","经销商加盟","代理加盟","合作代理","战略合作","合作开发","加入我们","共赢合作","加盟支持","经销商招募","品牌加盟"] 

# 博彩
gambling = ["博彩","伯才","擦皮奥","六合彩","彩票","查票","彩金","赌博","赌","赌场","赌钱","赌球","赌球","赌马","威尼斯","娱乐","赌徒", "博彩公司", "网上赌博", "投注", "庄家", "赌资", "赌石", "赌城", "棋牌", "扑克", "筹码", "龙虎斗", "百家乐", "轮盘", "角子机", "拉斯维加斯", "赌场风云", "赌博片", "博弈论", "赌术", "赌技", "赌博游戏", "亚洲博彩", "澳门博彩"]

# 医保
health_insurance = ["医保"]

# 退费
back = ["退费","退款","退还","退钱","钱"]

black_words = {
    # 类别1
    "high_金融APP类":{
        # 单一词语命中，直接判黑
        "black": ["京东金","金条账户"],

        # A B 各至少命中一个，判黑
        "A": ["京东","美团","致富宝","支付宝","借呗","戒备","花呗","华北","金融"],
        "B": ["账户","异常","一场","冻结","网贷","征信","关闭","客服中心","亲属","什么人"],

        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别2
    "high_冒充机关单位购物":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A":government_agency_shop,
        "B": ["肉","送过来","商家","商户","物资","采购","买","卖"],
        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别3
    "high_冒充机关单位恐吓":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A":government_agency,
        "B":scare,
        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别4
    "high_退费":{
        # 单一词语命中，直接判黑
        "black": ["退费"],
        # A B 各至少命中一个，判黑
        "A": ["网课","教育"],
        "B": back,
        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别5
    "high_免费送礼(快递发货)":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A":express+app,
        "B":gift,
    },

    # 类别6
    "high_中奖":{
        # 单一词语命中，直接判黑
        "black": ["中奖"],
        # A B 各至少命中一个，判黑
        "A": [],
        "B": [],
        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别7
    "high_问卷返现":{
        # 单一词语命中，直接判黑
        "black": ["问卷调研"],
        # A B 各至少命中一个，判黑
        "A": questionnaire,
        "B": feedback,
        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别8
    "high_博彩":{
        # 单一词语命中，直接判黑
        "black": [],
        "A": gambling,
        "B": ["网","注册","新人","平台","玩"],
        # a b c 各至少命中一个，判黑
        # a b c 中 2 个至少命中一个，判灰
        # a b c 只有 1 个命中，判白
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别9
    "high_网游":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A": ["网游","游戏","游戏平台","玩家","娱乐"],
        "B": ["充值","充值卡","充值码","充值账号","充值账户","充值金额"] + feedback,
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别10
    "high_冒充客服":{
    # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A": ["淘宝","天猫","京东","抖音"],
        "B": ["工作人员","客服","联盟"]+feedback,
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 类别11
    "high_快递丢失":{
        # 单一词语命中，直接判黑
        "black": ["快递丢失"],
        # A B 各至少命中一个，判黑
        "A":express,
        "B":["丢失","遗失"],
    },

    # 类别12
    "high_刷单":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A":like,
        "B":["佣金","返现","兼职","押大小","收入","赚钱","提现"],
    },


    # 中危 类别1
    "mid_加盟入驻":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A": app,
        "B": join,
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 中危 类别2
    "mid_好评返现":{
        # 单一词语命中，直接判黑
        "black": [],
        # A B 各至少命中一个，判黑
        "A": like,
        "B": feedback,
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 中危 类别3
    "mid_回馈老用户":{
        # 单一词语命中，直接判黑
        "black": ["回馈老用户"],
        # A B 各至少命中一个，判黑
        "A": ["老用户","老顾客","老会员","老客户","老客人"],
        "B": feedback,
        "a": [""],
        "b": [""],
        "c": [""],
    },

    # 中危 类别4
    "mid_医保退费":{
        # 单一词语命中，直接判黑
        "black": ["医保退费"],
        # A B 各至少命中一个，判黑
        "A": health_insurance,
        "B": back,
        "a": [""],
        "b": [""],
        "c": [""],
    },

}